app/controllers/main_controller.rb

SELECT `topics`.* FROM `topics` WHERE `topics`.`order` = 1 ORDER BY topics.order LIMIT 1
SELECT "news".* FROM "news" WHERE (topics_id=5) ORDER BY updated_at DESC LIMIT 1
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 'all' AND (video=1) ORDER BY topics.order LIMIT 1
SELECT `topics`.* FROM `topics` ORDER BY topics.order DESC LIMIT 1
---
	def index
		@topic = Topic.find_by_order(1)
		@topic1 = Topic.find_by_order(2)
		@pictures = News.find(:all, :conditions => ['topics_id=?', @topic],:order=>'updated_at desc')
		@pic = News.find(:all, :conditions => ['topics_id=?', @topic1],:order=>'updated_at desc')
		@vid = Topic.last

SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 ORDER BY topics.order LIMIT 1
SELECT `news`.* FROM `news` WHERE (topics_id=1) ORDER BY updated_at desc
---
	def mainpage
		@topics = Topic.find(:all,:order=>'updated_at desc')
		@topic = Topic.find(1)
		@pictures = News.find(:all, :order=>'updated_at desc', :conditions => ['topics_id=?',@topic])

SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 ORDER BY topics.order LIMIT 1
SELECT `news`.* FROM `news` WHERE (topics_id=1) ORDER BY updated_at desc
SELECT COUNT(*) FROM `news` WHERE (topics_id=1)
SELECT `news`.* FROM `news` WHERE (topics_id=1) ORDER BY updated_at desc LIMIT 3 OFFSET 0
---
	def all
		@topic = Topic.find_by_id(params[:id])
		@pics= News.find(:all, :conditions => ['topics_id=?', @topic],:order=>'updated_at desc')
		@pictures = News.paginate(:page => params[:page], :per_page => 3, :conditions => ['topics_id=?', @topic],:order=>'updated_at desc')

SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 2 ORDER BY topics.order LIMIT 1
SELECT `news`.* FROM `news` WHERE (topics_id=2)
---
	def news
		@topic = Topic.find_by_id(params[:id])
		@pictures = News.find(:all, :conditions => ['topics_id=?', @topic])

SELECT `news`.* FROM `news` WHERE `news`.`id` = 16 LIMIT 1
---
	def content
		#@topic = Topic.find_by_id(params[:id])
		@news = News.find_by_id(params[:id])