app/controllers/news_controller.rb

SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 ORDER BY topics.order LIMIT 1
SELECT `news`.* FROM `news` WHERE (topics_id=1)
SELECT `news`.* FROM `news` WHERE (topics_id=1) LIMIT 5 OFFSET 0
---
  def index
    @topic = Topic.find_by_id(params[:topic_id])
    @picutes = News.find(:all, :conditions => ['topics_id=?', @topic])
    @news = News.paginate(:page => params[:page], :per_page => 5,:conditions => ['topics_id=?', @topic])

SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 ORDER BY topics.order LIMIT 1
---
  def new
    @news = News.new
    @topic = Topic.find_by_id(params[:topic_id])

SELECT `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 ORDER BY topics.order LIMIT 1
---
  def edit
    @news = News.find(params[:id])
    @topic = Topic.find_by_id(params[:topic_id])