app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics` ORDER BY topics.order
---
  def index
    @topics = Topic.all