app/controllers/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'admin' LIMIT 1
---
	def login
		if request.post? and params[:user]
     	@user = User.new(params[:user])
     	user = User.find_by_username @user.username